function buildAWall (input) {
    let cubicYards = [];
    let isBuild = true;

    while (isBuild) {
        let cubicYardSum = 0;
        for (let i = 0; i < input.length; i++) {
            if (input[i] !== 30) {
                cubicYardSum += 195;
                input[i]++;
            }
        }

        if (cubicYardSum !== 0) {
            cubicYards.push(cubicYardSum);
        } else {
            isBuild = false;
        }
    }
    let totalSum = 0;
    for (let i of cubicYards) {
        totalSum += i;
    }

    console.log(cubicYards.join(', '));

    console.log(`${totalSum * 1900} pesos`);
}
buildAWall ([21, 25, 28]);

// Напишете програма, която следи изграждането на 30-футова стена. Ще ви бъде даден масив от низове, 
// които трябва да бъдат анализирани като числа, представляващи първоначалната височина на дългите мили 
// участъци от стената, във футове. Всяка секция има свой строителен екипаж, който може да добави 1 фут 
// височина на ден, като използва 195 кубични ярда бетон. Всички екипажи работят едновременно (вижте примерите), 
// което означава, че всички участъци, които не са завършени (високи са по-малко от 30 фута), 
// растат с 1 фут всеки ден. Когато участък от стената е завършен, екипажът й е облекчен.
// Вашата програма трябва да следи колко бетон се използва дневно до завършването на цялата стена. 
// В крайна сметка отпечатайте на един ред, разделени със запетая и интервал, количеството бетон, 
// използван всеки ден, и на втори ред, крайната цена на стената. Един кубичен ярд бетон струва 1900 песос.