function ladybugs (input) {
    let n = input.shift();
    let field = (new Array(n)).fill(0);
    let ladyBugIndexes = input.shift().split(' ');

    for (let index of ladyBugIndexes) {
        index = Number(index);
        if (index >= 0 && index < n) {
            field[index] = 1;
        }
    }

    for (let command of input) {
        let tokens = command.split(' ');
        let startingIndex = Number(tokens[0]);

        if (field[startingIndex] == 1) {
            let currentIndex = startingIndex;
            let direction = tokens[1];
            let offset = Number(tokens[2]);

            if (direction == 'left') {
                offset *= -1;
            }
            while (currentIndex >= 0 && currentIndex < n && field[currentIndex] == 1) {
                currentIndex += offset;
            }
            field[startingIndex] = 0;
            if (currentIndex >= 0 && currentIndex < n) {
                currentIndex = 1;
            }
        }

    }

    console.log(field.join(' '));
    
}


ladybugs ([ 3, '0 1', '0 right 1', '2 right 1' ]);






// Получавате размер на полето и индекси на калинките вътре в полето.
//  Калинката променя позицията си отляво или отдясно с определена дължина на мухата. 
//  Една команда към калинка изглежда така: "0 вдясно 1". Това означава, че малкото насекомо, 
//  поставено на индекс 0, трябва да лети с един индекс вдясно. Ако калинката кацне върху друга калинка,
//   тя продължава да лети в същата посока със същата дължина на мухата. Ако калинката излети от полето, я няма.
// Например, представете си, че ви е дадено поле с размер 3 и калинки с индекси 0 и 1.
//  Ако калинката с индекс 0 трябва да лети вдясно с дължина 1 (0 вдясно 1), тя ще се опита да кацне на индекс 1 
//  но тъй като там има друга калинка, тя ще продължи надясно с допълнителна дължина от 1, кацайки на индекс 2. 
//  След това, ако същата калинка трябва да лети вдясно с дължина 1 (2 вдясно 1), ще кацне някъде извън полето, така че отлита:

// Ако ви бъде даден индекс за калинка, в който няма калинка, нищо не се случва. Ако ви бъде даден индекс на калинка,
//  който е извън полето, нищо не се случва.
// Вашата задача е да създадете програмата, симулираща калинки, летящи наоколо, без да правят нищо. В крайна сметка отпечатайте
//  всички клетки в полето, разделени с празни интервали. За всяка клетка, в която има калинка,
//   отпечатайте '1' и за всяка празна клетка отпечатайте '0'. За примера по-горе, изходът трябва да бъде '0 1 0'.
// Вход
// • Ще получите масив от низове и първият елемент е цяло число – размерът на полето
// • Вторият елемент е низ, съдържащ началните индекси на всички калинки, разделени с празно пространство. 
// Дадените индекси могат или не могат да бъдат в обхвата на полето
// • Следващите елементи в масива са команди във формата: „{индекс на калинка} {направление} {дължина на мухата}“
// Изход
// • Отпечатайте всички клетки в полето във формат: `{cell} {cell} … {cell}`
// o Ако клетка има калинка, отпечатайте '1'
// o Ако клетка е празна, отпечатайте '0'